timeline.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-09 Tue 16:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org14d5a62" class="outline-2">
<h2 id="org14d5a62">Publish History Timeline</h2>
<div class="outline-text-2" id="text-org14d5a62">
<p>
<i>Chronological sitemap with links to articles</i>
</p>

<p>
<b>January 2018</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/kazumi-ikenaga-niwatazumi">Kazumi Ikenaga: <i>Niwatazumi</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/akane-matsumoto-night-and-day">Akane Matsumoto: <i>Night &amp; Day</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/ayumi-koketsu-art">Ayumi Koketsu: <i>Art</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/bungalow-you-already-know">Bungalow: <i>You Already Know</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/emiko-voice-carta">Emiko Voice: <i>Carta</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/ryosuke-hashizume-group-incomplete-voices">Ryosuke Hashizume Group: <i>Incomplete Voices</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/yasumasa-kumagai-j-straight-ahead">Yasumasa Kumagai: <i>J-Straight Ahead</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/arco-asymmetry">Arco: <i>Asymmetry</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/sayaka-kishi-featuring-te">Sayaka Kishi: <i>Featuring Te</i></a></li>
</ul>
<p>
<b>February 2018</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/akiko-suda-flowers-on-the-hill">Akiko Suda: <i>Flowers On The Hill</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hiroco-nagano-okurimono">Hiroco Nagano: <i>Okurimono</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/kaori-vibes-quartet-flying-mind">Kaori Vibes Quartet: <i>Flying Mind</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/satoshi-kosugi-bass-on-times">Satoshi Kosugi: <i>Bass on Times</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hitomi-nishiyama-trio-many-seasons">Hitomi Nishiyama Trio: <i>Many Seasons</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/keisuke-nakamura-humadope">Keisuke Nakamura: <i>Humadope</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/junichiro-ohkuchi-trio-invisible">Junichiro Ohkuchi Trio: <i>Invisible</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/mayuko-katakura-faith">Mayuko Katakura: <i>Faith</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/takuji-yamada-lite-blue">Takuji Yamada: <i>Lite Blue</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/seiji-endo-circle-for-peace">Seiji Endo: <i>Circle for Peace</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/koichi-sato-melancholy">Koichi Sato: <i>Melancholy of a Journey</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/rie-taguchi-gift">Rie Taguchi: <i>The Gift</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/ryosuke-hashizume-needful-things">Ryosuke Hashizume: <i>Needful Things</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/toshihiko-inoue-vayu">Toshihiko Inoue: <i>Vayu</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/sohnosuke-imaizumi-rin">Sohnosuke Imaizumi: <i>Rin</i></a></li>
</ul>
<p>
<b>March 2018</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/mayuko-katakura-inspiration">Mayuko Katakura: <i>Inspiration</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/sachiko-ikuta-trio-haru">Sachiko Ikuta Trio: <i>Haru No Kaze</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/sumito-oi-sumitty-and-the-funfair">Sumito Oi: <i>Sumitty &amp; The Funfair</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/tomoka-miwa-colors">Tomoka Miwa: <i>Colors in Silence</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hitomi-nishiyama-trio-music-in-you">Hitomi Nishiyama Trio: <i>Music in You</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/seiji-endo-tsutaete-ikou">Seiji Endo: <i>Tsutaete Ikou</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/meu-coracao-a-tempo">Meu Coracao: <i>A Tempo</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/ami-fukui-trio-new-journey">Ami Fukui Trio: <i>New Journey</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/atomi-hamada-this-is-atomi">Atomi Hamada: <i>This is Atomi</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/kaori-vibes-quartet-cross-point">Kaori Vibes Quartet: <i>Cross Point</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/les-komatis-les-komatis">Les Komatis: <i>Les Komatis</i></a></li>
</ul>
<p>
<b>April 2018</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/mayuko-katakura-echoes-of-three">Mayuko Katakura: <i>The Echoes of Three</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hitomi-nishiyama-trio-parallax-live">Hitomi Nishiyama Trio “Parallax”: <i>Live</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/manabu-ohishi-trio-wish">Manabu Ohishi Trio: <i>Wish</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hara-dairiki-trio-youve-changed">Hara Dairiki Trio: <i>You’ve Changed</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/kenichiro-shinzawa-piano-works">Ken’ichiro Shinzawa: <i>Piano Works</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/miki-hayama-trio-wide-angle">Miki Hayama Trio: <i>Wide Angle</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/yuya-wakai-images">Yuya Wakai: <i>Images</i></a></li>
</ul>
<p>
<b>May 2018</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/ayumi-koketsu-rainbow-tales">Ayumi Koketsu: <i>Rainbow Tales</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/bungalow-past-life">Bungalow: <i>Past Life</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/sanae-ishikawa-feel-like-makin-love">Sanae Ishikawa: <i>Feel Like Makin’ Love</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/taihei-asakawa-catastrophe-in-jazz">Taihei Asakawa: <i>Catastrophe in Jazz</i></a></li>
</ul>
<p>
<b>July 2018</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/ko-omura-introspect">Ko Omura: <i>Introspect</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/takako-yamada-flow-of-time">Takako Yamada: <i>The Flow of Time</i></a></li>
</ul>
<p>
<b>August 2018</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yukako-yamano-1st-stage">Yukako Yamano: <i>1st Stage</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hamasaki-matsumoto-bigcatch">Wataru Hamasaki Meets Akane Matsumoto Trio: <i>Big Catch</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/akihiro-yoshimoto-quartet-moving-color">Akihiro Yoshimoto Quartet: <i>Moving Color</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hideaki-hori-trio-unconditional-love">Hideaki Hori Trio: <i>Unconditional Love</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/yasumasa-kumagai-i-need-a-change-too">Yasumasa Kumagai: <i>I Need a Change, Too</i></a></li>
</ul>
<p>
<b>September 2018</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/hakuei-kim-trio-open-the-green-door">Hakuei Kim Trio: <i>Open the Green Door</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/ami-fukui-amizm">Ami Fukui: <i>Amizm</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/koichi-sato-utopia">Koichi Sato: <i>Utopia</i></a></li>
</ul>
<p>
<b>October 2018</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/taihei-asakawa-trio-touch-of-winter">Taihei Asakawa Trio: <i>Touch of Winter</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/sayaketts-colors">Sayaketts: <i>Colors</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/seiji-endo-sakura-meditation">Seiji Endo: <i>Sakura Meditation</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/michiyo-matsushita-sally-gardens">Michiyo Matsushita: <i>Sally Gardens</i></a></li>
</ul>
<p>
<b>November 2018</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/trispace-trispace">Trispace: <i>Trispace</i></a></li>
</ul>
<p>
<b>December 2018</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/fumie-chiba-trio-tip-of-dream">Fumie Chiba Trio: <i>Tip of Dream</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/taihei-asakawa-waltz-for-debby">Taihei Asakawa: <i>Waltz for Debby</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/sanae-ishikawa-grown-up-christmas">Sanae Ishikawa: <i>Grown-up Christmas Gift</i></a></li>
</ul>
<p>
<b>January 2019</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/tokuhiro-doi-quartet-amalthea">Tokuhiro Doi Quartet: <i>Amalthea</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/maki-fujimura-best-wishes">Maki Fujimura: <i>Best Wishes</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/ryosuke-hashizume-group-visible-invisible">Ryosuke Hashizume Group: <i>Visible/Invisible</i></a></li>
</ul>
<p>
<b>February 2019</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/shinpei-ruike-george-nakajima-n40">Shinpei Ruike &amp; George Nakajima: <i>N.40°</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/akane-matsumoto-playing-new-york">Akane Matsumoto: <i>Playing New York</i></a></li>
</ul>
<p>
<b>March 2019</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/blue-dot-halo">Blue Dot: <i>Halo</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/masako-kunisada-m">Masako Kunisada: <i>M</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/zephyr-zephyr">Zephyr: <i>Zephyr</i></a></li>
</ul>
<p>
<b>April 2019</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/harumi-nomoto-trio-virgo">Harumi Nomoto Trio: <i>Virgo</i></a></li>
</ul>
<p>
<b>May 2019</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yuichiro-aratake-light-flows-in">Yuichiro Aratake: <i>The Light Flows In</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hikari-ichihara-group-move-on">Hikari Ichihara Group: <i>Move On</i></a></li>
</ul>
<p>
<b>June 2019</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/hitomi-nishiyama-trio-sympathy">Hitomi Nishiyama Trio: <i>Sympathy</i></a></li>
</ul>
<p>
<b>July 2019</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/seiji-endo-genji-monogatari-volume-1">Seiji Endo: <i>Genji Monogatari Volume 1</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/layla-tomomi-sakai-island">Layla Tomomi Sakai: <i>The Island</i></a></li>
</ul>
<p>
<b>August 2019</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/nobie-benin-rio-tokyo">Nobie: <i>Bénin Rio Tokyo</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/daiki-yasukagawa-trio-kanmai">Daiki Yasukagawa Trio: <i>Kanmai</i></a></li>
</ul>
<p>
<b>September 2019</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/sayaka-kishi-trio-life-is-too-great">Sayaka Kishi Trio: <i>Life Is Too Great</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/minoru-yoshiki-soulstation-path-of-hope">Minoru Yoshiki Soulstation: <i>Path of Hope</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/shinichi-kato-bass-on-cinema">Shinichi Kato: <i>Bass on Cinema</i></a></li>
</ul>
<p>
<b>October 2019</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/mie-joke-etrenne">Mie Joké: <i>Etrenne</i></a></li>
</ul>
<p>
<b>November 2019</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/mabumi-yamaguchi-let-your-mind-alone">Mabumi Yamaguchi: <i>Let Your Mind Alone</i></a></li>
</ul>
<p>
<b>December 2019</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yako-horikita-shining-hour">Yako Horikita: <i>Shining Hour</i></a></li>
</ul>
<p>
<b>January 2020</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/nhorhm-extra-edition">NHORHM: <i>New Heritage of Real Heavy Metal -Extra Edition-</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/miki-hayama-prelude-to-a-kiss">Miki Hayama: <i>Prelude to a Kiss</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/seiji-tada-workout">Seiji Tada: <i>Workout!!</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hideaki-hori-trio-in-my-words">Hideaki Hori Trio: <i>In My Words</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/routine-jazz-sextet-routine-jazz-sextet">Routine Jazz Sextet: <i>Routine Jazz Sextet</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/maiko-trio-live-three">Maiko Trio: <i>Live! Three</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/rabbitoo-national-anthem-of-unknown">Rabbitoo: <i>National Anthem of Unknown Country</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hideaki-kanazawa-sumire-kuribayashi-nijuso">Hideaki Kanazawa &amp; Sumire Kuribayashi: <i>Nijuso</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/noriko-satomi-a-love-supreme">Noriko Satomi: <i>A Love Supreme</i></a></li>
</ul>
<p>
<b>February 2020</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/azumi-almost-like-being-in-love">Azumi: <i>Almost Like Being in Love</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hiromi-miura-we-dont-know-yet">Hiromi Miura: <i>We Don’t Know Yet</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/yudo-matsuo-bonanza">Yudo Matsuo: <i>Bonanza</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/daiki-yasukagawa-trio-trios-ii">Daiki Yasukagawa Trio: <i>Trios II</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/fumio-karashima-trio-its-just-beginning">Fumio Karashima Trio: <i>It’s Just Beginning</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/reikan-kobayashi-gakudan-hitori">Reikan Kobayashi: <i>Gakudan Hitori</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/miyuki-moriya-cats-cradle">Miyuki Moriya: <i>Cat’s Cradle</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/trio-export-small-pieces-for-flying-padre">Trio Export 63.1.0.X: <i>Small Pieces for Flying Padre</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/chihiro-yamanaka-trio-living-without-friday">Chihiro Yamanaka Trio: <i>Living Without Friday</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/ryosuke-hashizume-group-wordless">Ryosuke Hashizume Group: <i>Wordless</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/emiko-voice-x-suga-dairo-phase-2">Emiko Voice x Suga Dairo: <i>Phase 2</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/maiko-solo">Maiko: <i>Solo</i></a></li>
</ul>
<p>
<b>March 2020</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yukari-inoue-sakura">Yukari Inoue: <i>Sakura</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/eriko-shimizu-sora">Eriko Shimizu: <i>Sora</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/manabu-ohishi-trio-gift">Manabu Ohishi Trio: <i>Gift</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/yuko-miyawaki-song-of-flower">Yuko Miyawaki: <i>Song of Flower</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/shunichi-yanagi-trio-bubble-fish">Shunichi Yanagi Trio: <i>Bubble Fish</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/baby-brothers-bb">Baby Brothers: <i>Bb</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/bungalow-metropolitan-oasis">Bungalow: <i>Metropolitan Oasis</i></a></li>
</ul>
<p>
<b>April 2020</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/harumi-nomoto-trio-belinda">Harumi Nomoto Trio: <i>Belinda</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/yuka-ueda-agora">Yuka Ueda: <i>Agora</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/motoi-kanamori-my-soul-meeting">Motoi Kanamori: <i>My Soul Meeting</i></a></li>
</ul>
<p>
<b>May 2020</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/arco-birth">Arco: <i>Birth</i></a></li>
</ul>
<p>
<b>August 2020</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/fuse-live-fuse">Fuse: <i>Live Fuse</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/chihiro-yamanaka-trio-when-october">Chihiro Yamanaka Trio: <i>When October Goes</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/kohsuke-mine-quintet-major-to-minor">Kohsuke Mine Quintet: <i>Major to Minor</i></a></li>
</ul>
<p>
<b>September 2020</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/masako-kunisada-wonderful-life">Masako Kunisada: <i>Wonderful Life</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/aquapit-aquapit">Aquapit: <i>Aquapit</i></a></li>
</ul>
<p>
<b>October 2020</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/naoko-tanaka-trio-memories">Naoko Tanaka Trio: <i>Memories</i></a></li>
</ul>
<p>
<b>November 2020</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/tcq-memories-of-t">TCQ: <i>Memories of T</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/akane-matsumoto-memories-of-you">Akane Matsumoto: <i>Memories of You</i></a></li>
</ul>
<p>
<b>January 2021</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/takayuki-yagi-new-departure">Takayuki Yagi: <i>New Departure</i></a></li>
</ul>
<p>
<b>February 2021</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/miki-hirose-scratch">Miki Hirose: <i>Scratch</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/yuka-ueda-dois">Yuka Ueda: <i>Dois</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/water-me-water-me">Water Me!: <i>Water Me!</i></a></li>
</ul>
<p>
<b>March 2021</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/duo-tremolo-resonance">Duo Tremolo: <i>Resonance</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/layla-tomomi-sakai-whisper-not">Layla Tomomi Sakai: <i>Whisper Not</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/chihiro-yamanaka-trio-madrigal">Chihiro Yamanaka Trio: <i>Madrigal</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/arco-live-at-yoncha">Arco: <i>Live At Yoncha</i></a></li>
</ul>
<p>
<b>April 2021</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yukiko-hayakawa-trio-gallery">Yukiko Hayakawa Trio: <i>Gallery</i></a></li>
</ul>
<p>
<b>May 2021</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yoshihito-p-koizumi-by-coincidence">Yoshihito “P” Koizumi P-Project: <i>By Coincidence</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/naoko-sakata-trio-flower-clouds">Naoko Sakata Trio: <i>Flower Clouds</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/fumie-chiba-beautiful-days">Fumie Chiba: <i>Beautiful Days</i></a></li>
</ul>
<p>
<b>June 2021</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/fumiko-yamazaki-here-goes">Fumiko Yamazaki: <i>Here Goes!</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/shinichi-kato-and-masahiko-sato-duet">Shinichi Kato &amp; Masahiko Sato: <i>Duet</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/shigeo-fukuda-and-toshiki-nunokawa">Shigeo Fukuda &amp; Toshiki Nunokawa: <i>Childhood’s Dream</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/protean-protean">Protean: <i>Protean</i></a></li>
</ul>
<p>
<b>July 2021</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/meu-coracao-hall-tone">Meu Coracao: <i>Hall Tone</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/toshihiko-inoue-and-masaki-hayashi">Toshihiko Inoue &amp; Masaki Hayashi: <i>Mistral</i></a></li>
</ul>
<p>
<b>August 2021</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/trigraph-fever">Trigraph: <i>Fever</i></a></li>
</ul>
<p>
<b>October 2021</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/ruriko-kawamura-blossoms">Ruriko Kawamura: <i>Blossoms</i></a></li>
</ul>
<p>
<b>December 2021</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/ami-fukui-trio-urban-clutter">Ami Fukui Trio: <i>Urban Clutter</i></a></li>
</ul>
<p>
<b>January 2022</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yukakoyamano-yukariinoue-dubai">Yukako Yamano &amp; Yukari Inoue: <i>Dubai Suite</i></a></li>
</ul>
<p>
<b>May 2022</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/bungalow-unseen-scenes">Bungalow: <i>Unseen Scenes</i></a></li>
</ul>
<p>
<b>July 2022</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/harumi-nomoto-trio-another-ordinary-day">Harumi Nomoto Trio: <i>Another Ordinary Day</i></a></li>
</ul>
<p>
<b>August 2022</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yukako-yamano-3rd-stage">Yukako Yamano: <i>3rd Stage</i></a></li>
</ul>
<p>
<b>September 2022</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yasumasa-kumagai-pray">Yasumasa Kumagai: <i>Pray</i></a></li>
<li>Akiko Koizumi &amp; Kana Hiramatsu Duo: <i>Reverie</i> †</li>
<li>Baby Brothers: <i>Happy Christmas with Bb</i> †</li>
<li>Akiko Toyama Trio: <i>All Is In The Sky</i> †</li>
<li>Seiji Endo: <i>Angel Eyes</i> †</li>
<li>Yuka Ueda: <i>Pianistas E Mim</i> †</li>
<li>Clepsydra: <i>Un Jour</i> †</li>
<li>Hiromi Shimizu: <i>Hiromi As Is in New York</i> †</li>
</ul>
<p>
<b>October 2022</b>
</p>
<ul class="org-ul">
<li>Hikari Ichihara: <i>Sara Smile</i> †</li>
<li>Fumio Karashima: <i>Great Time</i> †</li>
<li>Emiko x Dairo Suga: <i>Phase 1</i> †</li>
<li>Trispace: <i>Aria</i> †</li>
<li>Hitomi Nishiyama: <i>Parallax</i> †</li>
<li>Fumie Chiba: <i>Rougequeue</i> †</li>
<li>Q Ishikawa &amp; Seiji Endo: <i>Nakayoshi</i> †</li>
<li>Ryosuke Hashizume Group: <i>Side Two</i> †</li>
<li>Satomi Kawakami: <i>Orchid</i> †</li>
<li>Junichiro Ohkuchi Trio: <i>Big Smile</i> †</li>
<li>Michiyo Matsushita: <i>Prayer for Peace</i> †</li>
<li>Yurie Nejime: <i>Sometime Back</i> †</li>
<li>Yukari Inoue &amp; Shunji Takenaka: <i>Moegi</i> †</li>
<li>Yuri Hirota: <i>Flea Circus</i> †</li>
<li>Maki Fujimura: <i>What's Love?</i> †</li>
<li>Nobie: <i>Primary</i> †</li>
<li>Hitomi Nishiyama: <i>Astrolabe</i> †</li>
<li>Chihiro Yamanaka: <i>Lach Doch Mal</i> †</li>
<li>Chie Ayado: <i>For All We Know</i> †</li>
<li>Hiromi Shimizu: <i>'Round Midnight</i> †</li>
<li>Fumie Chiba Trio: <i>Echoes</i> †</li>
<li>Meu Coração: <i>Hall Tone 2</i> †</li>
<li>Mikako Nishikawa: <i>Day Dream</i> †</li>
<li>Hitomi Nishiyama Trio "Parallax": <i>Shift</i> †</li>
<li>Yuichiro Aratake: <i>Reunion at Bunca</i> †</li>
<li>Maki Nakao: <i>Super Moon</i> †</li>
<li>Kohei Kawanami &amp; Heitetsu Rin: <i>Ginrin Trip</i> †</li>
<li>Maki Fujimura: <i>Yours</i> †</li>
<li>Hitomi Yamakami: <i>As We Are</i> †</li>
<li>Chihiro Yamanaka: <i>After Hours</i> †</li>
</ul>
<p>
<b>November 2022</b>
</p>
<ul class="org-ul">
<li>Tomoko Gakudan: <i>Moment</i> †</li>
<li>Akiko Toyama Trio: <i>Ambition</i> †</li>
<li>Girafe: <i>Asa No Kirin</i> †</li>
<li>Ritsuko Iwayama: <i>Dramatic Moments</i> †</li>
<li>Tsutomu Okada: <i>Laughing Heart</i> †</li>
<li>Chihiro Yamanaka: <i>Abyss</i> †</li>
<li>Ryosuke Hashizume Group: <i>As We Breathe</i> †</li>
<li>Ruriko Kawamura: <i>Loo Loo</i> †</li>
<li>Hitomi Yamakami: <i>Withness</i> †</li>
<li>Yuri Hirota: <i>Magical Moonlight</i> †</li>
<li>Chihiro Yamanaka: <i>Bravogue</i> †</li>
<li>Sanae Ishikawa Seasonal Japanese Songbook Project: <i>Winter</i> †</li>
</ul>
<p>
<b>December 2022</b>
</p>
<ul class="org-ul">
<li>Shinichi Kato: <i>B-Hot Creations</i> †</li>
<li>Girafe: <i>Haru No Sketch</i> †</li>
</ul>
<p>
<b>January 2023</b>
</p>
<ul class="org-ul">
<li>Labtranquillo: <i>Tide</i> †</li>
<li>Sawa Shiraishi: <i>Tea for Two</i> †</li>
</ul>
<p>
<b>May 2023</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/introduction-to-jazz-of-japan">Introduction to Jazz of Japan</a> ^</li>
<li><a href="https://www.jazzofjapan.com/p/yoyogi-naru">Yoyogi Naru</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/alfie">Alfie</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/chihiro-yamanaka-outside-by-the-swing">Chihiro Yamanaka: <i>Outside by the Swing</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/birdland">Birdland</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/into-the-blue">Into the Blue</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/paco">Paco</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/ps-bar">P's Bar</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/our-delight">Our Delight</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/naoko-akimoto-no-one-else">Naoko Akimoto: <i>No One Else</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hot-house">Hot House</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/all-of-me">All of Me</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/polka-dots">Polka Dots</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/shunichi-yanagi-trio-slope">Shunichi Yanagi Trio: <i>Slope</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/the-deep">The Deep</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/barbra">Barbra</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/rie-taguchi-the-gift-ii">Rie Taguchi: <i>The Gift II</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/apollo">Apollo</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/cafe-beulmans">Cafe Beulmans</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/porto">Porto</a> ~</li>
</ul>
<p>
<b>June 2023</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/bullys">Bully's</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/george-nakajima-trio-first-touch">George Nakajima Trio: <i>First Touch</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/a-un">A-Un</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/jz-brat">JZ Brat</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/body-and-soul">Body &amp; Soul</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/mariko-maeda-awareness">Mariko Maeda: <i>Awareness</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hiro-kimura-quintet-folds">Hiro Kimura Quintet: <i>Folds</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/soultrane">Soultrane</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/hitomi-nishiyama-vibrant">Hitomi Nishiyama: <i>Vibrant</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/donfan">Donfan</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/yuichiro-aratake-music-make-us-one">Yuichiro Aratake: <i>Music Make Us One</i></a></li>
</ul>
<p>
<b>July 2023</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/intro">Intro</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/akihiro-yoshimoto-quartet-64-charlesgate">Akihiro Yoshimoto Quartet: <i>64 Charlesgate</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/seiji-harakawa-quartet-skipping-down">Seiji Harakawa Quartet: <i>Skipping Down the Street</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/independence">Independence</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/jazz-bird">Jazz Bird</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/akane-matsumoto-nanami-haruta-for">Akane Matsumoto &amp; Nanami Haruta: <i>For My Lady</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/boozy-muse">Boozy Muse</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/ryosuke-hashizume-group-acoustic">Ryosuke Hashizume Group: <i>Acoustic Fluid</i></a></li>
</ul>
<p>
<b>August 2023</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/cochi">Cochi</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/fumika-asari-introducin">Fumika Asari: <i>Introducin’</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/zimagine">Zimagine</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/tetsuji-yoshida-and-mikiko-nagatake">Tetsuji Yoshida &amp; Mikiko Nagatake Duo: <i>Live at Knuttel House</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/knuttel-house">Knuttel House</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/yuichi-narita-urban-nocturne">Yuichi Narita: <i>Urban Nocturne</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/sul-madrugada-luar">Sul Madrugada: <i>Luar</i></a></li>
</ul>
<p>
<b>September 2023</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yukako-yamano-imperial">Yukako Yamano: <i>Imperial</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/bungalow-abstract-messages">Bungalow: <i>Abstract Messages</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/dug">Dug</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/fnk-canvas">FNK: <i>Canvas</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/mamoru-ishida-ishida-mamoru-4-feat">Mamoru Ishida: <i>Ishida Mamoru 4 feat. Mike Rivett</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/no-room-for-squares">No Room for Squares</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/mikiko-nagatake-solo">Mikiko Nagatake: <i>Solo</i></a></li>
</ul>
<p>
<b>October 2023</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yasumasa-kumagai-last-resort">Yasumasa Kumagai &amp; J-Jazz Homies: <i>Last Resort</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/emiko-voice-standard-trio">Emiko Voice: <i>Standard Trio</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/rabbitoo-the-torch">Rabbitoo: <i>The Torch</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/sometime">Sometime</a> ~</li>
</ul>
<p>
<b>November 2023</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/kaori-vibes-quartet-starry-nights">Kaori Vibes Quartet: <i>Starry Nights</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/shinpei-ruike-george-nakajima-duo">Shinpei Ruike &amp; George Nakajima: <i>Duo</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/kazumi-ikenaga-niwatazumi">Kazumi Ikenaga: <i>Niwatazumi</i></a> *</li>
<li><a href="https://www.jazzofjapan.com/p/akane-matsumoto-little-girl-blue">Akane Matsumoto: <i>Little Girl Blue</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/nanami-haruta-ii">Nanami Haruta: <i>II</i></a></li>
</ul>
<p>
<b>December 2023</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/lydian">Lydian</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/hideaki-hori-horizon">Hideaki Hori: <i>Horizon</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hideaki-hori-melodies-for-night-day">Hideaki Hori: <i>Melodies for Night &amp; Day</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/whats-j-jazz">What's J Jazz?</a> ^</li>
<li><a href="https://www.jazzofjapan.com/p/miyuki-moriya-uta-oto">Miyuki Moriya: <i>Uta Oto</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/baby-brothers-happy-christmas-with-bb">Baby Brothers: <i>Happy Christmas with Bb</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/kaoru-azuma-hitomi-nishiyama-faces">Kaoru Azuma / Hitomi Nishiyama: <i>Faces</i></a></li>
</ul>
<p>
<b>January 2024</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/pit-inn">Pit Inn</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/mase-hiroko-quintet-first-contact">Mase Hiroko Quintet: <i>First Contact</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/yuka-yanagihara-trio-inner-views">Yuka Yanagihara Trio: <i>Inner Views</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/kohaku">Kohaku</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/keisuke-nakamura-humadope-2">Keisuke Nakamura: <i>Humadope 2</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/ami-fukui-trio-nova-manha">Ami Fukui Trio: <i>Nova Manhã</i></a></li>
</ul>
<p>
<b>February 2024</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/polyglot-talk-vol-1">Polyglot: <i>Talk, Vol. 1</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/b-flat">B-flat</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/hiroshi-fukutomi-memory-stones">Hiroshi Fukutomi: <i>Memory Stones</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/jazz-spots-of-japan">Jazz Spots of Japan</a> ^</li>
<li><a href="https://www.jazzofjapan.com/p/chihiro-yamanaka-lach-doch-mal">Chihiro Yamanaka: <i>Lach Doch Mal</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/naoko-tanaka-appreciation">Naoko Tanaka: <i>Appreciation</i></a></li>
</ul>
<p>
<b>March 2024</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/junichiro-ohkuchi-trio-invisible">Junichiro Ohkuchi Trio: <i>Invisible</i></a> *</li>
<li><a href="https://www.jazzofjapan.com/p/jabuticaba-jabuticaba">Jabuticaba: <i>Jabuticaba</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/nami-kano-mawsim">Nami Kano: <i>Mawsim</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/expression">Expression</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/yasumasa-kumagai-i-need-a-change-too">Yasumasa Kumagai: <i>I Need a Change, Too</i></a> *</li>
<li><a href="https://www.jazzofjapan.com/p/efreydut-fairway">eFreydut: <i>Fairway</i></a></li>
</ul>
<p>
<b>April 2024</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/akihiro-yoshimoto-quartet-moving-color">Akihiro Yoshimoto Quartet: <i>Moving Color</i></a> *</li>
<li><a href="https://www.jazzofjapan.com/p/bon-courage">Bon Courage</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/seiji-endo-sakura-meditation">Seiji Endo: <i>Sakura Meditation</i></a> *</li>
<li><a href="https://www.jazzofjapan.com/p/ami-fukui-amizm">Ami Fukui: <i>Amizm</i></a> *</li>
<li><a href="https://www.jazzofjapan.com/p/satin-doll">Satin Doll</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/hitomi-nishiyama-trio-calling">Hitomi Nishiyama Trio: <i>Calling</i></a></li>
</ul>
<p>
<b>May 2024</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/takumi-seino-motohiko-ichino-frozen-dust">Takumi Seino &amp; Motohiko Ichino: <i>Frozen Dust</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/mabumi-yamaguchi-let-your-mind-alone">Mabumi Yamaguchi: <i>Let Your Mind Alone</i></a> *</li>
<li><a href="https://www.jazzofjapan.com/p/noriko-satomi-project-n">Noriko Satomi: <i>Project-N</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/koen-dori-classics">Koen-Dori Classics</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/erisa-ogawa-where-have-u-been">Erisa Ogawa: <i>Where Have U Been?</i></a></li>
</ul>
<p>
<b>June 2024</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/blue-note-tokyo">Blue Note Tokyo</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/otohito-fuse-trio-isolated">Otohito Fuse Trio: <i>Isolated</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/salt-peanuts">Salt Peanuts</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/miwo-tranquillo">Miwo: <i>Tranquillo</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/reiko-yamamoto-square-pyramid">Reiko Yamamoto: <i>The Square Pyramid</i></a></li>
</ul>
<p>
<b>July 2024</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yuki-ito-retattanni-no-mori">Yuki Ito: <i>Retattanni no Mori</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/kazumi-ikenaga-taihei-asakawa-nordnote">Kazumi Ikenaga &amp; Taihei Asakawa: <i>NordNote</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hikari-ichihara-sara-smile">Hikari Ichihara: <i>Sara Smile</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/akihiro-yoshimoto-takashi-sugawa-oxymoron">Akihiro Yoshimoto &amp; Takashi Sugawa: <i>Oxymoron</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/motohiko-ichino-sketches">Motohiko Ichino: <i>Sketches</i></a></li>
</ul>
<p>
<b>August 2024</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yoshiko-saita-back-in-time-to-boston">Yoshiko Saita: <i>Back in Time to Boston</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/somethin">Somethin’</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/eri-chichibu-crossing-reality">Eri Chichibu: <i>Crossing Reality</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/banda-feliz-boa-viagem">Banda Feliz: <i>Boa Viagem</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/koichi-sato-embryo">Koichi Sato: <i>Embryo</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/gate-one">Gate One</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/yasumasa-kumagai-ryu-kawamura-ol-school-jazz">Yasumasa Kumagai &amp; Ryu Kawamura: <i>Ol’ School Jazz</i></a></li>
</ul>
<p>
<b>September 2024</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/jazzspot-j">Jazzspot J</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/nobie-primary">Nobie: <i>Primary</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/sayaka-kishi-trio-banquet">Sayaka Kishi Trio: <i>Banquet</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/apple-jump">Apple Jump</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/clepsydra-un-jour">Clepsydra: <i>Un Jour</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/sumire-kuribayashi-trio-toys">Sumire Kuribayashi Trio: <i>Toys</i></a></li>
</ul>
<p>
<b>October 2024</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/hitomi-nishiyama-dot">Hitomi Nishiyama: <i>Dot</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/kanmachi-63">Kanmachi 63</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/mamoru-ishida-afterglow">Mamoru Ishida: <i>Afterglow</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/sweet-rain">Sweet Rain</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/mabumi-yamaguchi-viento">Mabumi Yamaguchi: <i>Viento</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/chie-nishimura-virtual-silence">Chie Nishimura: <i>Virtual Silence</i></a></li>
</ul>
<p>
<b>November 2024</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/makiyo-sakai-silver-painting">Makiyo Sakai: <i>Silver Painting</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/ryosuke-hashizume-group-side-two">Ryosuke Hashizume Group: <i>Side Two</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/someday">Someday</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/fumie-chiba-rougequeue">Fumie Chiba: <i>Rougequeue</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/naru">Naru</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/yuka-yanagihara-trio-beloved-ones">Yuka Yanagihara Trio: <i>Beloved Ones</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/seiji-endo-piano-pieces-collection">Seiji Endo: <i>Piano Pieces Collection</i></a></li>
</ul>
<p>
<b>December 2024</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/ten-top-10s-for-live-jazz-in-tokyo">Ten Top 10s for Live Jazz in Tokyo</a> ^</li>
<li><a href="https://www.jazzofjapan.com/p/seiji-endo-piano-pieces-collection-ii">Seiji Endo: <i>Piano Pieces Collection II</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hiro-kimura-trees">Hiro Kimura: <i>Trees</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/akane-matsumoto-oh-lady-be-good">Akane Matsumoto: <i>Oh, Lady Be Good</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/jazz-nutty">Jazz Nutty</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/megumi-yonezawa-masa-kamaguchi-ken-kobayashi-boundary">Megumi Yonezawa / Masa Kamaguchi / Ken Kobayashi: <i>Boundary</i></a></li>
</ul>
<p>
<b>January 2025</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/nobie-takayoshi-baba-owari-to-hajimari">Nobie &amp; Takayoshi Baba: <i>Owari to Hajimari</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/daiki-yasukagawa-new-trio-three-roses">Daiki Yasukagawa New Trio: <i>The Three Roses</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/motoi-kanamori-the-live">Motoi Kanamori: <i>The Live</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/velvet-sun">Velvet Sun</a> ~</li>
</ul>
<p>
<b>February 2025</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/magnolia-el-viento-y-las-flores">Magnolia: <i>El viento y las flores</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/miyuki-moriya-beyond-the-sea">Miyuki Moriya: <i>Beyond the Sea</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/ami-fukui-trio-mcy">Ami Fukui Trio: <i>MCY</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hideaki-hori-wataru-hamasaki-encounter">Hideaki Hori &amp; Wataru Hamasaki: <i>Encounter</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/strings">Strings</a> ~</li>
</ul>
<p>
<b>March 2025</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/emiko-voice-yuka-yanagihara-enyana">Emiko Voice &amp; Yuka Yanagihara: <i>Enyana</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/ghost-peak-goat-on-a-peak">Ghost Peak: <i>The Goat on a Peak</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hikari-ichihara-group-unity">Hikari Ichihara Group: <i>Unity</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/sunny-side">Sunny Side</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/hitomi-nishiyama-echo">Hitomi Nishiyama: <i>Echo</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/hitomi-nishiyama-trio-im-missing-you">Hitomi Nishiyama Trio: <i>I’m Missing You</i></a></li>
</ul>
<p>
<b>April 2025</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/fe-live-at-virtuoso">Fe: <i>Live at Virtuoso</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/akane-matsumoto-ayumi-koketsu-trust">Akane Matsumoto &amp; Ayumi Koketsu: <i>Trust</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/nardis">Nardis</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/kaito-nakamura-invisible-diary">Kaito Nakamura: <i>Invisible Diary</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/shinya-fukumori-trio-for-2-akis">Shinya Fukumori Trio: <i>For 2 Akis</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/oto-ya-hiroo">Oto-ya Hiroo</a> ~</li>
</ul>
<p>
<b>May 2025</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/layla-tomomi-sakai-stolen-moments">Layla Tomomi Sakai: <i>Stolen Moments</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/kanoko-kitajima-long-way-to-go">Kanoko Kitajima: <i>Long Way to Go</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/setagaya-trio-progress">Setagaya Trio: <i>Progress</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/thelonious">Thelonious</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/yosuke-sato-george-nakajima-longing">Yosuke Sato &amp; George Nakajima: <i>Longing</i></a></li>
</ul>
<p>
<b>June 2025</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/kunpei-nakabayashi-orchestra-circles">Kunpei Nakabayashi Orchestra: <i>Circles</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/mayuko-katakura-duality-of-my-soul">Mayuko Katakura: <i>The Duality of My Soul</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/in-f">In F</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/melodies-melodies">Melodies: <i>Melodies</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/taeko-kurita-akira-sotoyama-duo">Taeko Kurita &amp; Akira Sotoyama: <i>Duo</i></a></li>
</ul>
<p>
<b>July 2025</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/taeko-kurita-ko-tsu-ko-tsu">Taeko Kurita: <i>Ko-tsu-ko-tsu</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/koto-ha-to-shiro-o-matoeba">Koto ha, To: <i>Shiro o Matoeba</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/natural">Natural</a> ~</li>
<li><a href="https://www.jazzofjapan.com/p/nhorhm-new-heritage-of-real-heavy-metal">NHORHM: <i>New Heritage of Real Heavy Metal</i></a></li>
</ul>
<p>
<b>August 2025</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/yuji-ito-koichi-hirata-duo-two-for-the-road">Yuji Ito &amp; Koichi Hirata Duo: <i>Two for the Road</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/michiyo-matsushita-trio-free">Michiyo Matsushita Trio: <i>Free</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/ryosuke-hashizume-group-as-we-breathe">Ryosuke Hashizume Group: <i>As We Breathe</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/chihiro-yamanaka-abyss">Chihiro Yamanaka: <i>Abyss</i></a></li>
<li><a href="https://www.jazzofjapan.com/p/bigboy">Bigboy</a> ~</li>
</ul>
<p>
<b>September 2025</b>
</p>
<ul class="org-ul">
<li><a href="https://www.jazzofjapan.com/p/sumire-kuribayashi-kazuma-fujimoto-takashi-sugawa-tides-of-blue">Sumire Kuribayashi / Kazuma Fujimoto / Takashi Sugawa: <i>Tides of Blue</i></a></li>
</ul>
<hr />
<pre class="example" id="orga2bc11f">
KEY:
   Albums
 ~ Clubs and venues
 ^ Guides 
 † Previews
 * Article updated/reposted
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-09-09 Tue 16:39</p>
</div>
</body>
</html>
